name: "LeNet"
layer {
  name: "mnist1"
  type: "HDF5Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  hdf5_data_param {
    source: "/home/willie/workspace/ToLMDB/lmdb/train.txt"
    batch_size: 1000
  }
}
layer {
  name: "mnist2"
  type: "HDF5Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  hdf5_data_param {
    source: "/home/willie/workspace/ToLMDB/lmdb/validate.txt"
    batch_size: 1000
  }
}

layer {
  name: "slicer"
  type: "Slice"
  bottom: "data"
  ## Example of label with a shape N x 3 x 1 x 1
  top: "h1"
  top: "d"
  top: "h2"
  slice_param {
    axis: 1
    slice_point: 7
    slice_point: 18
  }
}

layer {
  name: "concath1"
  bottom: "h1"
  bottom: "d"
  top: "h1d"
  type: "Concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "iph1"
  type: "InnerProduct"
  bottom: "h1d"
  top: "iph1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 14
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "reluh1"
  type: "Sigmoid"
  bottom: "iph1"
  top: "reluh1"
}

#heuristic2
layer {
  name: "concath2"
  bottom: "h2"
  bottom: "d"
  top: "h2d"
  type: "Concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "iph2"
  type: "InnerProduct"
  bottom: "h2d"
  top: "iph2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 14
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "reluh2"
  type: "Sigmoid"
  bottom: "iph2"
  top: "reluh2"
}

#combine layer
layer {
  name: "concatCombine"
  bottom: "reluh1"
  bottom: "reluh2"
  top: "combine"
  type: "Concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "combine"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 14
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu2"
  type: "Sigmoid"
  bottom: "ip2"
  top: "relu2"
}

layer {
  name: "ip3"
  type: "InnerProduct"
  bottom: "relu2"
  top: "ip3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu3"
  type: "Sigmoid"
  bottom: "ip3"
  top: "relu3"
}

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "relu3"
  bottom: "label"
  top: "loss"
}
